---
kind: method
id: M:Autodesk.Revit.DB.SynchronizeWithCentralOptions.#ctor
source: html/cf9b4e29-c004-534f-51b8-56abda16c82b.htm
---
# Autodesk.Revit.DB.SynchronizeWithCentralOptions.#ctor Method

Constructs a new instance of SynchronizeWithCentralOptions initialized with default options.

## Syntax (C#)
```csharp
public SynchronizeWithCentralOptions()
```